// 1. 변수의 중복선언 허용
// var x = 10;
//var x = '김철수';

//let : 중복 선언시 에러를 띄움
// let x = 10; 
// let x = '김철수';

// console.log(`x: ${x}`);
//========================================================
//2. 블록레벨 스코프 지원하지 않음
// var i = '안녕';
//for문 내부의 i가 전역변수화 됨
// for(var i = 0; i < 3; i++){
//      console.log(`for문 바깥쪽 i: ${i}`);
// }

//let : 블록레벨 스코프 지원
// let i = '안녕';
// for (let i = 0; i < 3; i++) {
//     console.log(i);
// }
// console.log(`for문 바깥쪽 i: ${i}`);
//========================================================
//3. 변수 호이스팅 : 변수 선언문을 자동으로 맨 위로 올림
// z = 100;
// console.log(z);
// var z;
// let z;
//========================================================
